# Задание 1
def function (value):
    return value

print('Введите значение: ')
a = int(input())
print(function(a))